&НаКлиенте
Процедура ПередЗаписью(Отказ, РежимЗаписи)
    Если ЗначениеЗаполнено(Запись.Задача) Тогда
        Данные = ПолучитьДанныеПоЗадаче(Запись.Задача);
        Запись.Этап = Данные.Этап;
        Запись.Проект = Данные.Проект;
    КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоЗадаче(СсылкаНаЗадачу)
    ЗадачаОбъект = СсылкаНаЗадачу.ПолучитьОбъект();
    Результат = Новый Структура("Этап, Проект");
    
    Если ЗадачаОбъект <> Неопределено И ЗначениеЗаполнено(ЗадачаОбъект.Владелец) Тогда
        Результат.Этап = ЗадачаОбъект.Владелец;
        ЭтапОбъект = ЗадачаОбъект.Владелец.ПолучитьОбъект();
        
        Если ЭтапОбъект <> Неопределено И ЗначениеЗаполнено(ЭтапОбъект.Владелец) Тогда
            Результат.Проект = ЭтапОбъект.Владелец;
        КонецЕсли;
    КонецЕсли;
    Возврат Результат;
КонецФункции